CREATE OR REPLACE VIEW DB.mart_sales_1c_sales AS
SELECT
	toDate(`Период`) AS `_Дата`,
	`ДоговорКонтрагента`,
	`Активность`,
	`ДокументПродажи`,
	`ЗаказПокупателя`,
	`Контрагент`,
	`Номенклатура`,
	`Организация`,
	`Подразделение`,
	`Проект`,
	`Регистратор`,
	toInt64OrZero(`ЗаказПокупателяНомер`) AS `ЗаказПокупателяНомер`,
	toFloat64(`Количество`) AS `Количество`,
	toFloat64(`НДС`) AS `НДС`,
	toFloat64(`Стоимость`) AS `Стоимость`,
	toFloat64(`СтоимостьБезСкидок`) AS `СтоимостьБезСкидок`
FROM DB."raw_1c_Продажи"